AkitaEngineering/ESP32-C3-Reticulum-Node/src/InterfaceManager.cpp
#ifdef LORA_ENABLED
    processLoRaInput();
#endif

#ifdef HAM_MODEM_ENABLED
    processHAMModemInput();
#endif

#if defined(HAM_MODEM_ENABLED) && defined(AUDIO_MODEM_ENABLED)
    pollAX25FromAudioModem();
#endif
}

void InterfaceManager::setupSerial() {
    // KissSerial is started in main.cpp for KISS interface
    LOG_INFO("IF: KISS Serial interface ready (RX=%d, TX=%d, baud=%d).", KISS_UART_RX, KISS_UART_TX, KISS_SERIAL_SPEED);
}

void InterfaceManager::setupWiFi() {
    // On ESP32-C3 the USB CDC controller shares clocking with the radio
    // subsystem.  Cycling through WIFI_OFF can glitch the USB peripheral
    // and cause the host to see a disconnect.  Go straight to STA mode.
    WiFi.disconnect(false); // clear any stale connection without turning off radio
    WiFi.mode(WIFI_STA);
    delay(100);            // let the radio settle
    // ESP-NOW is latency-sensitive; modem sleep can drop/delay frames.
    esp_wifi_set_ps(WIFI_PS_NONE);

    // Runtime credentials are loaded from /config.json before interface setup.
    // An empty password is valid for an explicitly configured open network.
    const char* configuredSsid = getConfiguredWiFiSsid();
    const char* configuredPassword = getConfiguredWiFiPassword();
    if (WIFI_STA_CONNECT_ENABLED && strlen(configuredSsid) > 0) {
        WiFi.begin(configuredSsid, configuredPassword);
        LOG_INFO("IF: Connecting to configured WiFi SSID");
        int attempts = 0;
        while (WiFi.status() != WL_CONNECTED && attempts < 20) {
            delay(500); DebugSerial.print("."); attempts++;
        }
        if (WiFi.status() == WL_CONNECTED) {
            LOG_INFO("IF: WiFi connected.");
            LOG_INFO("IF: IP address: %s", WiFi.localIP().toString().c_str());
            setenv("TZ", "UTC0", 1);
            tzset();
            configTime(0, 0, "pool.ntp.org", "time.nist.gov", "time.google.com");
            if (_udp.begin(RNS_UDP_PORT)) {
                DebugSerial.print("IF: UDP Listening on port "); DebugSerial.println(RNS_UDP_PORT);
            } else {
                DebugSerial.println("! ERROR: Failed to start UDP listener!");
            }
        } else {
            LOG_WARN("IF: WiFi connection failed after %d attempts.", attempts);
        }
    } else {
        if (!WIFI_STA_CONNECT_ENABLED) {
            LOG_INFO("IF: AP connection disabled (WIFI_STA_CONNECT_ENABLED=0). Running ESP-NOW-only mode.");
        } else {
            LOG_INFO("IF: No WiFi credentials configured, skipping AP connection.");
        }
        LOG_INFO("IF: WiFi radio active in STA mode for ESP-NOW.");
    }
}

void InterfaceManager::setupESPNow() {
     DebugSerial.print("IF: Device MAC: "); DebugSerial.println(WiFi.macAddress());

    esp_err_t pwr_err = esp_wifi_set_max_tx_power(ESP_NOW_TX_POWER_QDBM);
    if (pwr_err == ESP_OK) {
        DebugSerial.print("IF: WiFi TX power set (qdbm): ");
        DebugSerial.println(ESP_NOW_TX_POWER_QDBM);
    } else {
        DebugSerial.print("! WARN: Failed to set TX power: ");
        DebugSerial.println(esp_err_to_name(pwr_err));
    }

#if ESP_NOW_ENABLE_LR
    esp_err_t proto_err = esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N | WIFI_PROTOCOL_LR);
    if (proto_err == ESP_OK) {
        DebugSerial.println("IF: WiFi protocol includes 11LR for ESP-NOW");
    } else {
        DebugSerial.print("! WARN: Failed to enable 11LR protocol: ");
        DebugSerial.println(esp_err_to_name(proto_err));
    }
#endif

    // Optional channel override
    if (ESP_NOW_CHANNEL != 0) {
        esp_err_t ch_err = esp_wifi_set_channel(ESP_NOW_CHANNEL, WIFI_SECOND_CHAN_NONE);
        if (ch_err == ESP_OK) {
            DebugSerial.print("IF: Forced WiFi channel to "); DebugSerial.println(ESP_NOW_CHANNEL);
        } else {
            DebugSerial.print("! WARN: Failed to set WiFi channel: "); DebugSerial.println(esp_err_to_name(ch_err));
        }
    } else {
        DebugSerial.println("IF: ESP-NOW channel follows connected AP channel (ESP_NOW_CHANNEL=0).");
    }

    // Query current channel for debugging
    uint8_t curr_ch;
    wifi_second_chan_t second_ch;
    esp_wifi_get_channel(&curr_ch, &second_ch);
    DebugSerial.print("IF: Current WiFi channel: "); DebugSerial.println(curr_ch);

    if (esp_now_init() != ESP_OK) {
        DebugSerial.println("! ERROR: Initializing ESP-NOW failed!");
        return; // Cannot proceed with ESP-NOW
    }
    if (!_espNowRxQueue) {
        _espNowRxQueue = xQueueCreate(ESPNOW_RX_QUEUE_LENGTH, sizeof(EspNowRxFrame));
        if (!_espNowRxQueue) {
            DebugSerial.println("! ERROR: Failed to allocate ESP-NOW receive queue");
            esp_now_deinit();
            return;
        }
    } else {
        xQueueReset(_espNowRxQueue);
    }
    // Register static callback function which calls instance method
    esp_err_t result = esp_now_register_recv_cb(staticEspNowRecvCallback);
    if (result != ESP_OK) {
         DebugSerial.print("! ERROR: Failed to register ESP-NOW recv cb: "); DebugSerial.println(esp_err_to_name(result));
         esp_now_deinit();
         return;
    }
    result = esp_now_register_send_cb(staticEspNowSendCallback);
    if (result != ESP_OK) {
        DebugSerial.print("! ERROR: Failed to register ESP-NOW send cb: "); DebugSerial.println(esp_err_to_name(result));
        esp_now_unregister_recv_cb();
        esp_now_deinit();
        return;
    }

    _espNowInitialized = true;

    // Add broadcast peer initially (needed to receive broadcasts)
    if (!addEspNowPeer(espnow_broadcast_mac)) {
         DebugSerial.println("! WARN: Failed to add initial ESP-NOW broadcast peer");
    }
    DebugSerial.println("IF: ESP-NOW Initialized.");
}

#if BLUETOOTH_CLASSIC_AVAILABLE
void InterfaceManager::setupBluetooth() {
    const char* deviceName = getConfiguredNodeName();
      if (!_serialBT.begin(deviceName)) {
         DebugSerial.println("! ERROR: Bluetooth Serial initialization failed!");
     } else {
        DebugSerial.print("IF: Bluetooth ready. Device Name: ");
          DebugSerial.println(deviceName);
    }
}
#endif

