AkitaEngineering/ESP32-C3-Reticulum-Node/src/InterfaceManager.cpp
bool InterfaceManager::sendPacketViaEspNowInternal(const uint8_t *packetBuffer, size_t packetLen, const uint8_t *destinationAddr, bool enqueueOnFailure) {
    if (!_meshEnabled || !_espNowInitialized || !packetBuffer || packetLen == 0) return false;

    const uint8_t* targetMac = espnow_broadcast_mac; // Default to broadcast

#if ESP_NOW_INDISCRIMINATE_BROADCAST
    (void)destinationAddr;
#else
    if (destinationAddr != nullptr) { // If destination provided, try to find route
        RouteEntry* route = _routingTableRef.findRouteForInterface(destinationAddr, InterfaceType::ESP_NOW);
         if (route) {
             targetMac = route->next_hop_mac;
             // Ensure peer exists - crucial for direct send
             if (!checkEspNowPeer(targetMac)) {
                 if (!addEspNowPeer(targetMac)) {
                     targetMac = espnow_broadcast_mac; // Fallback if add fails
                 }
             }
         } else { targetMac = espnow_broadcast_mac; } // No route / wrong interface
    } // else: destinationAddr is null -> use broadcastMac
#endif

    if (packetLen <= ESPNOW_MAX_PAYLOAD_LEN) {
        esp_err_t result = esp_now_send(targetMac, packetBuffer, packetLen);
        if (result != ESP_OK) {
            DebugSerial.print("! ESP-NOW Send Error to "); Utils::printBytes(targetMac, 6, DebugSerial); DebugSerial.print(": "); DebugSerial.println(esp_err_to_name(result));
#if ESPNOW_STORE_FORWARD_ENABLED
            if (enqueueOnFailure) {
                enqueueEspNowPacket(packetBuffer, packetLen, destinationAddr);
            }
#endif
            return false;
        }
        recordInterfaceTx(InterfaceType::ESP_NOW, packetLen);
        return true;
    }

    const size_t maxChunk = ESPNOW_FRAG_CHUNK_DATA_LEN;
    const size_t totalChunksSz = (packetLen + maxChunk - 1) / maxChunk;
    if (totalChunksSz == 0 || totalChunksSz > ESPNOW_MAX_FRAGMENT_CHUNKS) {
        DebugSerial.print("! ESP-NOW fragmentation failed, packet too large for chunk count: ");
        DebugSerial.println(packetLen);
#if ESPNOW_STORE_FORWARD_ENABLED
        if (enqueueOnFailure) {
            enqueueEspNowPacket(packetBuffer, packetLen, destinationAddr);
        }
#endif
        return false;
    }

    const uint8_t totalChunks = static_cast<uint8_t>(totalChunksSz);
    _espNowTxMessageId++;
    if (_espNowTxMessageId == 0) {
        _espNowTxMessageId = 1;
    }
    const uint16_t messageId = _espNowTxMessageId;
    const uint32_t fullCrc = espnow_crc32(packetBuffer, packetLen);

    for (uint8_t chunkIndex = 0; chunkIndex < totalChunks; ++chunkIndex) {
        const size_t offset = static_cast<size_t>(chunkIndex) * maxChunk;
        const size_t remaining = packetLen - offset;
        const size_t chunkLen = remaining > maxChunk ? maxChunk : remaining;

        uint8_t frame[ESPNOW_MAX_PAYLOAD_LEN];
        const size_t frameLen = EspNowFraming::packFragment(
            frame, sizeof(frame), messageId, chunkIndex, totalChunks, fullCrc,
            ESPNOW_FRAGMENT_CRC32_ENABLED, packetBuffer + offset, chunkLen);
        if (frameLen == 0) return false;

        esp_err_t result = esp_now_send(targetMac, frame, frameLen);
        if (result != ESP_OK) {
            DebugSerial.print("! ESP-NOW fragment send failed (msg=");
            DebugSerial.print(messageId);
            DebugSerial.print(", chunk=");
            DebugSerial.print(chunkIndex);
            DebugSerial.print("/");
            DebugSerial.print(totalChunks);
            DebugSerial.print("): ");
            DebugSerial.println(esp_err_to_name(result));
#if ESPNOW_STORE_FORWARD_ENABLED
            if (enqueueOnFailure) {
                enqueueEspNowPacket(packetBuffer, packetLen, destinationAddr);
            }
#endif
            return false;
        }
    }

    recordInterfaceTx(InterfaceType::ESP_NOW, packetLen);
    return true;
}

bool InterfaceManager::sendPacketViaWiFi(const uint8_t *packetBuffer, size_t packetLen, const uint8_t *destinationAddr) {
     if (WiFi.status() != WL_CONNECTED || !packetBuffer || packetLen == 0) return false;

    IPAddress targetIp;
    uint16_t targetPort = RNS_UDP_PORT;
    IPAddress broadcastIp = WiFi.broadcastIP();
    targetIp = broadcastIp; // Default to broadcast

     if (destinationAddr != nullptr) { // If destination provided, try to find route
          RouteEntry* route = _routingTableRef.findRouteForInterface(destinationAddr, InterfaceType::WIFI_UDP);
          if (route && route->next_hop_ip) {
            targetIp = route->next_hop_ip;
            if (route->next_hop_port != 0) targetPort = route->next_hop_port;
        } // else: use broadcast IP
     } // else: destinationAddr is null -> use broadcast IP

    if (!targetIp || targetIp == INADDR_NONE) {
        DebugSerial.println("! WARN: UDP Target IP is invalid, cannot send.");
        return false;
    }

    if (!_udp.beginPacket(targetIp, targetPort)) return false;
    size_t sent = _udp.write(packetBuffer, packetLen);
    if (sent != packetLen) {
        DebugSerial.print("! WARN: UDP write incomplete (sent "); DebugSerial.print(sent); DebugSerial.print("/"); DebugSerial.print(packetLen); DebugSerial.println(" bytes)");
        (void)_udp.endPacket();
        return false;
    }
    if (!_udp.endPacket()) {
        DebugSerial.println("! ERROR: UDP endPacket failed!");
        return false;
    }
    recordInterfaceTx(InterfaceType::WIFI_UDP, packetLen);
    return true;
}

bool InterfaceManager::enqueueEspNowPacket(const uint8_t *packetBuffer, size_t packetLen, const uint8_t *destinationAddr) {
#if !ESPNOW_STORE_FORWARD_ENABLED
    (void)packetBuffer;
    (void)packetLen;
    (void)destinationAddr;
    return false;
#else
    if (!packetBuffer || packetLen == 0 || packetLen > MAX_PACKET_SIZE) {
        return false;
    }

    const bool enqueued = _espNowStoreQueue.enqueue(
        packetBuffer, packetLen, destinationAddr, millis(), ESPNOW_SF_RETRY_MS);
    if (enqueued && _espNowStoreQueue.droppedOldest()) {
        DebugSerial.println("! WARN: ESP-NOW store-forward queue full, dropping oldest packet");
    }
    return enqueued;
#endif
}

void InterfaceManager::dropStoreForwardQueue() {
#if ESPNOW_STORE_FORWARD_ENABLED
    _espNowStoreQueue.clear();
#endif
}

