AkitaEngineering/ESP32-C3-Reticulum-Node/src/InterfaceManager.cpp
    if (_espNowRxAssemblies.size() < ESPNOW_MAX_RX_ASSEMBLIES) {
        EspNowRxAssembly slot;
        slot.active = true;
        memcpy(slot.senderMac.data(), senderMac, 6);
        slot.messageId = messageId;
        slot.totalChunks = totalChunks;
        slot.hasCrc = false;
        slot.expectedCrc = 0;
        slot.lastUpdateMs = millis();
        slot.chunks.assign(totalChunks, std::vector<uint8_t>());
        slot.receivedChunk.assign(totalChunks, 0);
        slot.receivedCount = 0;
        _espNowRxAssemblies.push_back(slot);
        return &_espNowRxAssemblies.back();
    }

    const unsigned long now = millis();
    size_t oldestIndex = 0;
    unsigned long oldestAge = now - _espNowRxAssemblies[0].lastUpdateMs;
    for (size_t i = 1; i < _espNowRxAssemblies.size(); ++i) {
        const unsigned long age = now - _espNowRxAssemblies[i].lastUpdateMs;
        if (age > oldestAge) {
            oldestAge = age;
            oldestIndex = i;
        }
    }

    auto &slot = _espNowRxAssemblies[oldestIndex];
    slot.active = true;
    memcpy(slot.senderMac.data(), senderMac, 6);
    slot.messageId = messageId;
    slot.totalChunks = totalChunks;
    slot.hasCrc = false;
    slot.expectedCrc = 0;
    slot.lastUpdateMs = millis();
    slot.chunks.assign(totalChunks, std::vector<uint8_t>());
    slot.receivedChunk.assign(totalChunks, 0);
    slot.receivedCount = 0;
    return &slot;
}

void InterfaceManager::handleEspNowPayload(const uint8_t *senderMac, const uint8_t *incomingData, int len) {
    if (!_packetReceiver || !senderMac || !incomingData || len <= 0) return;

    uint16_t messageId = 0;
    uint8_t chunkIndex = 0;
    uint8_t totalChunks = 0;
    bool hasCrc = false;
    uint32_t expectedCrc = 0;
    const uint8_t *chunkData = nullptr;
    size_t chunkLen = 0;

    const bool looksFragmented = len >= 3 && incomingData[0] == EspNowFraming::MAGIC0 &&
                                 incomingData[1] == EspNowFraming::MAGIC1 &&
                                 incomingData[2] == EspNowFraming::VERSION;
    if (!parseEspNowFragment(incomingData, len, messageId, chunkIndex, totalChunks, hasCrc, expectedCrc, chunkData, chunkLen)) {
        if (looksFragmented) {
            DebugSerial.println("! WARN: Malformed ESP-NOW fragment discarded.");
            return;
        }
        if (len <= static_cast<int>(MAX_PACKET_SIZE)) {
            recordInterfaceRx(InterfaceType::ESP_NOW, static_cast<size_t>(len));
            _packetReceiver(incomingData, static_cast<size_t>(len), InterfaceType::ESP_NOW, senderMac, IPAddress(), 0);
        } else {
            DebugSerial.print("! WARN: Oversized raw ESP-NOW payload (");
            DebugSerial.print(len);
            DebugSerial.println(") discarded.");
        }
        return;
    }

    if (totalChunks == 1) {
        if (chunkLen <= MAX_PACKET_SIZE && (!hasCrc || espnow_crc32(chunkData, chunkLen) == expectedCrc)) {
            recordInterfaceRx(InterfaceType::ESP_NOW, chunkLen);
            _packetReceiver(chunkData, chunkLen, InterfaceType::ESP_NOW, senderMac, IPAddress(), 0);
        } else {
            DebugSerial.println("! WARN: Invalid single-fragment ESP-NOW CRC, dropped frame");
        }
        return;
    }

    EspNowRxAssembly *slot = getEspNowAssemblySlot(senderMac, messageId, totalChunks);
    if (!slot) return;
    if (slot->receivedCount == 0) {
        slot->hasCrc = hasCrc;
        slot->expectedCrc = expectedCrc;
    } else if (slot->hasCrc != hasCrc || (hasCrc && slot->expectedCrc != expectedCrc)) {
        slot->active = false;
        slot->chunks.clear();
        slot->receivedChunk.clear();
        slot->receivedCount = 0;
        DebugSerial.println("! WARN: ESP-NOW fragment CRC metadata mismatch, dropped frame");
        return;
    }

    if (chunkIndex >= slot->receivedChunk.size()) return;
    if (!slot->receivedChunk[chunkIndex]) {
        slot->receivedChunk[chunkIndex] = 1;
        slot->receivedCount++;
        size_t currentLen = 0;
        for (const auto &chunk : slot->chunks) {
            currentLen += chunk.size();
        }
        if (currentLen + chunkLen > MAX_PACKET_SIZE) {
            slot->active = false;
            slot->chunks.clear();
            slot->receivedChunk.clear();
            slot->receivedCount = 0;
            DebugSerial.println("! WARN: ESP-NOW reassembly exceeded MAX_PACKET_SIZE, dropped frame");
            return;
        }
        slot->chunks[chunkIndex].assign(chunkData, chunkData + chunkLen);
    }
    slot->lastUpdateMs = millis();

    if (slot->receivedCount == slot->totalChunks) {
        std::vector<uint8_t> assembled;
        assembled.reserve(MAX_PACKET_SIZE);
        for (const auto &chunk : slot->chunks) {
            assembled.insert(assembled.end(), chunk.begin(), chunk.end());
        }

        if (slot->hasCrc) {
            uint32_t computed = espnow_crc32(assembled.data(), assembled.size());
            if (computed != slot->expectedCrc) {
                DebugSerial.println("! WARN: ESP-NOW reassembly CRC32 mismatch, dropped frame");
                slot->active = false;
                slot->chunks.clear();
                slot->receivedChunk.clear();
                slot->receivedCount = 0;
                slot->hasCrc = false;
                slot->expectedCrc = 0;
                return;
            }
        }

        recordInterfaceRx(InterfaceType::ESP_NOW, assembled.size());
        _packetReceiver(assembled.data(), assembled.size(), InterfaceType::ESP_NOW, senderMac, IPAddress(), 0);
        slot->active = false;
        slot->chunks.clear();
        slot->receivedChunk.clear();
        slot->receivedCount = 0;
        slot->hasCrc = false;
        slot->expectedCrc = 0;
    }
}

void InterfaceManager::cleanupExpiredEspNowAssemblies() {
    const unsigned long now = millis();
    for (auto &slot : _espNowRxAssemblies) {
        if (slot.active && (now - slot.lastUpdateMs) > ESPNOW_REASSEMBLY_TIMEOUT_MS) {
            slot.active = false;
            slot.chunks.clear();
            slot.receivedChunk.clear();
            slot.receivedCount = 0;
            slot.hasCrc = false;
            slot.expectedCrc = 0;
        }
    }
}


// --- Debug Helpers ---
void InterfaceManager::printEspNowPeers() {
#if ESP_NOW_INDISCRIMINATE_BROADCAST
    DebugSerial.println("IF: Heard ESP-NOW neighbors (TX is broadcast):");
#else
    DebugSerial.println("IF: ESP-NOW peer list:");
#endif
    if (_espNowPeers.empty()) {
        DebugSerial.println("  (none)");
        return;
    }
    for (const auto &addr : _espNowPeers) {
        DebugSerial.print("  "); Utils::printBytes(addr.data(), 6, DebugSerial); DebugSerial.println();
    }
}

// --- Static Callbacks ---
// ESP-IDF v5 changed the callback signature to esp_now_recv_info_t.
#if defined(ESP_IDF_VERSION_MAJOR) && (ESP_IDF_VERSION_MAJOR >= 5)
void InterfaceManager::staticEspNowRecvCallback(const esp_now_recv_info_t *recv_info, const uint8_t *incomingData, int len) {
    const uint8_t* mac_addr = (recv_info != nullptr) ? recv_info->src_addr : nullptr;
#else
void InterfaceManager::staticEspNowRecvCallback(const uint8_t *mac_addr, const uint8_t *incomingData, int len) {
#endif
    if (_instance && _instance->_espNowRxQueue && mac_addr && incomingData &&
        len > 0 && len <= static_cast<int>(ESPNOW_MAX_PAYLOAD_LEN)) {
        EspNowRxFrame frame;
        memcpy(frame.senderMac, mac_addr, sizeof(frame.senderMac));
        frame.length = static_cast<uint16_t>(len);
        memcpy(frame.payload, incomingData, static_cast<size_t>(len));
        if (xQueueSend(_instance->_espNowRxQueue, &frame, 0) == pdTRUE) {
            _instance->espNowRxCount++;
        } else {
            _instance->espNowRxDropped++;
        }
    } else if (_instance) {
        _instance->espNowRxDropped++;
    }
}

#if defined(ESP_IDF_VERSION_MAJOR) && (ESP_IDF_VERSION_MAJOR >= 5)
void InterfaceManager::staticEspNowSendCallback(const wifi_tx_info_t *tx_info, esp_now_send_status_t status) {
    (void)tx_info;
#else
void InterfaceManager::staticEspNowSendCallback(const uint8_t *mac_addr, esp_now_send_status_t status) {
    (void)mac_addr;
#endif
    if (_instance) {
        if (status == ESP_NOW_SEND_SUCCESS) _instance->espNowTxOk++;
        else _instance->espNowTxFail++;
    }
}

void InterfaceManager::sendEspNowDiagKiss() {
    // Emit a KISS frame with cmd=0x06 containing ESP-NOW diagnostic text
    // Format: human-readable ASCII so host monitoring scripts can parse it
    uint8_t ch = 0;
    wifi_second_chan_t sec;
    esp_wifi_get_channel(&ch, &sec);
    int8_t txPwr = 0;
    esp_wifi_get_max_tx_power(&txPwr);

