AkitaEngineering/ESP32-C3-Reticulum-Node/src/InterfaceManager.cpp
    // Process incoming bytes from HAM modem via KISS
    while (HAM_MODEM_SERIAL.available()) {
        _hamModemKissProcessor.decodeByte(HAM_MODEM_SERIAL.read(), InterfaceType::HAM_MODEM);
    }
}

#if defined(HAM_MODEM_ENABLED) && defined(AUDIO_MODEM_ENABLED)
bool InterfaceManager::pollAX25FromAudioModem() {
    if (!_audioModem) return false;
    std::vector<uint8_t> frame;
    bool got = false;
    // Drain all available frames this loop
    while (_audioModem->receive(frame)) {
        got = true;
        // Deliver as if received over HAM modem (AX.25 over KISS)
        if (!frame.empty() && _packetReceiver) {
            // Interpret as raw AX.25 frame; wrap in KISS data frame for consistency
            recordInterfaceRx(InterfaceType::HAM_MODEM, frame.size());
            _packetReceiver(frame.data(), frame.size(), InterfaceType::HAM_MODEM, nullptr, IPAddress(), 0);
        }
    }
    return got;
}
#endif

#if defined(HAM_MODEM_ENABLED) && defined(AUDIO_MODEM_ENABLED)
// Static FreeRTOS task entry
void InterfaceManager::audioCaptureTask(void* arg) {
    InterfaceManager* self = static_cast<InterfaceManager*>(arg);
    if (self) self->audioCaptureLoop();
    vTaskDelete(nullptr);
}

void InterfaceManager::audioCaptureLoop() {
    const uint32_t samplePeriodUs = 1000000UL / AUDIO_MODEM_SAMPLE_RATE;
    while (true) {
        // Read ADC sample
        int raw = analogRead(AUDIO_MODEM_RX_PIN); // 0-4095
        int16_t centered = (int16_t)((raw - 2048) << 4); // center to signed 16-bit-ish
        if (_audioModem) {
            _audioModem->processAudioSample(centered);
        }
        delayMicroseconds(samplePeriodUs);
    }
}
#endif

bool InterfaceManager::sendPacketViaHAMModem(const uint8_t *packetBuffer, size_t packetLen) {
    if (!_hamModemInitialized || !packetBuffer || packetLen == 0) return false;
    
    // Encode packet with KISS framing
    std::vector<uint8_t> kissEncoded;
    KISSProcessor::encode(packetBuffer, packetLen, kissEncoded);
    
    // Send via HAM modem serial port
    size_t sent = HAM_MODEM_SERIAL.write(kissEncoded.data(), kissEncoded.size());
    if (sent != kissEncoded.size()) {
        DebugSerial.println("! WARN: HAM Modem write incomplete");
    }
    if (sent != kissEncoded.size()) return false;
    recordInterfaceTx(InterfaceType::HAM_MODEM, packetLen);
    return true;
}

// Helper: build AX.25 UI frame for APRS (dest defaults to "APRS-0")
static bool buildAX25UIFrame(const String& sourceCall, uint8_t sourceSsid,
                             const String& destCall, uint8_t destSsid,
                             const String& info, std::vector<uint8_t>& out)
{
    AX25::Frame frame;
    frame.source = AX25::Address(sourceCall.c_str(), sourceSsid);
    frame.destination = AX25::Address(destCall.c_str(), destSsid);
    frame.control = AX25::ControlType::U_UI;
    frame.pid = 0xF0; // No layer 3 protocol
    frame.info.assign(info.begin(), info.end());
    return AX25::encodeFrame(frame, out);
}

#ifdef WINLINK_ENABLED
bool InterfaceManager::winlinkSendRaw(const uint8_t* data, size_t len, void* context) {
    InterfaceManager* self = static_cast<InterfaceManager*>(context);
    if (!self || !self->_hamModemInitialized || !data || len == 0) {
        return false;
    }
    std::vector<uint8_t> kissEncoded;
    KISSProcessor::encode(data, len, kissEncoded);
    size_t sent = HAM_MODEM_SERIAL.write(kissEncoded.data(), kissEncoded.size());
    return sent == kissEncoded.size();
}
#endif

static String buildAprsWeatherTimestamp() {
    struct tm timeinfo;
    if (getLocalTime(&timeinfo, 1000)) {
        char buf[7];
        snprintf(buf, sizeof(buf), "%02d%02d%02d", timeinfo.tm_mday, timeinfo.tm_hour, timeinfo.tm_min);
        return String(buf);
    }

    const uint32_t minutes = millis() / 60000UL;
    const uint32_t days = minutes / 1440UL;
    const uint8_t day = (days % 31) + 1;
    const uint8_t hour = (minutes / 60UL) % 24;
    const uint8_t minute = minutes % 60;
    char buf[7];
    snprintf(buf, sizeof(buf), "%02u%02u%02u", day, hour, minute);
    return String(buf);
}

void InterfaceManager::sendAPRSPacket(const char* destination, const char* message) {
    if (!_hamModemInitialized) {
        DebugSerial.println("! ERROR: HAM Modem not initialized for APRS");
        return;
    }

    String info = String(destination) + ":" + String(message);
    std::vector<uint8_t> ax25;
    if (!buildAX25UIFrame(APRS_CALLSIGN, APRS_SSID, "APRS", 0, info, ax25)) {
        DebugSerial.println("! ERROR: Failed to encode AX.25 frame for APRS packet");
        return;
    }
    std::vector<uint8_t> kissEncoded;
    KISSProcessor::encode(ax25.data(), ax25.size(), kissEncoded);
    HAM_MODEM_SERIAL.write(kissEncoded.data(), kissEncoded.size());
}

void InterfaceManager::sendAPRSPosition(float lat, float lon, float altitude, const char* comment) {
    if (!_hamModemInitialized) {
        DebugSerial.println("! ERROR: HAM Modem not initialized for APRS");
        return;
    }

    // Format: !DDMM.MMNS/DDDMM.MMEW[comment]
    char latStr[10], lonStr[11];
    int latDeg = abs((int)lat);
    int lonDeg = abs((int)lon);
    float latMin = (abs(lat) - latDeg) * 60.0f;
    float lonMin = (abs(lon) - lonDeg) * 60.0f;

    /* Format minutes without using float-format specifiers (avoid linking float printf)
       APRS wants DDMM.MM (lat) and DDDMM.MM (lon) where MM.MM has two decimals. */
    int latMin100 = (int)(latMin * 100.0f + 0.5f);
    int latMinWhole = latMin100 / 100;
    int latMinFrac = latMin100 % 100;
    snprintf(latStr, sizeof(latStr), "%02d%02d.%02d", latDeg, latMinWhole, latMinFrac);

    int lonMin100 = (int)(lonMin * 100.0f + 0.5f);
    int lonMinWhole = lonMin100 / 100;
    int lonMinFrac = lonMin100 % 100;
    snprintf(lonStr, sizeof(lonStr), "%03d%02d.%02d", lonDeg, lonMinWhole, lonMinFrac);

    String info = "!";               // Position report
    info += String(latStr);
    info += (lat >= 0) ? "N" : "S";
    info += "/";                       // Symbol table (primary table)
    info += String(lonStr);
    info += (lon >= 0) ? "E" : "W";
    info += String(APRS_SYMBOL);       // Symbol character
    if (altitude > 0) {
        info += "/A=";
        info += String((int)(altitude * 3.28084)); // meters to feet
    }
    if (comment && strlen(comment) > 0) {
        info += String(comment);
    }

