AkitaEngineering/ESP32-C3-Reticulum-Node/src/InterfaceManager.cpp
    std::vector<uint8_t> ax25;
    if (!buildAX25UIFrame(APRS_CALLSIGN, APRS_SSID, "APRS", 0, info, ax25)) {
        DebugSerial.println("! ERROR: Failed to encode AX.25 frame for APRS position");
        return;
    }
    std::vector<uint8_t> kissEncoded;
    KISSProcessor::encode(ax25.data(), ax25.size(), kissEncoded);
    HAM_MODEM_SERIAL.write(kissEncoded.data(), kissEncoded.size());
}

void InterfaceManager::sendAPRSWeather(float temp, float humidity, float pressure, const char* comment) {
    if (!_hamModemInitialized) {
        DebugSerial.println("! ERROR: HAM Modem not initialized for APRS");
        return;
    }

    // APRS weather format: _DDHHMMcDDDsDDDgDDDtXXXrXXXpXXXPXXXhXXbXXXXX
    String info = "_" + buildAprsWeatherTimestamp();
    info += "c000"; // wind direction (degrees)
    info += "s000"; // wind speed (mph)
    info += "g000"; // gust speed (mph)

    int tempF = (int)(temp * 9.0 / 5.0 + 32.0);
    char tempStr[5]; snprintf(tempStr, sizeof(tempStr), "t%03d", abs(tempF));
    if (tempF < 0) tempStr[1] = '-'; // negative temps: t-XX
    info += String(tempStr);

    info += "r000"; // rain 1h (hundredths of inch)
    info += "p000"; // rain 24h (hundredths of inch)
    info += "P000"; // rain since midnight (hundredths of inch)

    char humStr[4]; snprintf(humStr, sizeof(humStr), "h%02d", (int)humidity);
    info += String(humStr);

    char pressStr[7]; snprintf(pressStr, sizeof(pressStr), "b%05d", (int)(pressure * 10));
    info += String(pressStr);

    if (comment && strlen(comment) > 0) {
        info += String(comment);
    }

    std::vector<uint8_t> ax25;
    if (!buildAX25UIFrame(APRS_CALLSIGN, APRS_SSID, "APRS", 0, info, ax25)) {
        DebugSerial.println("! ERROR: Failed to encode AX.25 frame for APRS weather");
        return;
    }
    std::vector<uint8_t> kissEncoded;
    KISSProcessor::encode(ax25.data(), ax25.size(), kissEncoded);
    HAM_MODEM_SERIAL.write(kissEncoded.data(), kissEncoded.size());
}

void InterfaceManager::sendAPRSMessage(const char* addressee, const char* message) {
    if (!_hamModemInitialized) {
        DebugSerial.println("! ERROR: HAM Modem not initialized for APRS");
        return;
    }

    char addr[10] = {0};
    strncpy(addr, addressee, 9);
    for (int i = strlen(addr); i < 9; i++) {
        addr[i] = ' ';
    }

    String info = ":";
    info += String(addr);
    info += ":";
    info += String(message);

    std::vector<uint8_t> ax25;
    if (!buildAX25UIFrame(APRS_CALLSIGN, APRS_SSID, "APRS", 0, info, ax25)) {
        DebugSerial.println("! ERROR: Failed to encode AX.25 frame for APRS message");
        return;
    }
    std::vector<uint8_t> kissEncoded;
    KISSProcessor::encode(ax25.data(), ax25.size(), kissEncoded);
    HAM_MODEM_SERIAL.write(kissEncoded.data(), kissEncoded.size());
}
#endif

#ifdef IPFS_ENABLED
// --- IPFS Implementation (Lightweight Client) ---
void InterfaceManager::setupIPFS() {
    DebugSerial.println("IF: Initializing IPFS client...");
    
    // IPFS client is lightweight - just needs WiFi connection
    if (WiFi.status() == WL_CONNECTED) {
        _ipfsInitialized = true;
        DebugSerial.print("IF: IPFS Gateway: ");
        DebugSerial.println(IPFS_GATEWAY_URL);
        DebugSerial.println("IF: IPFS client ready (gateway mode).");
    } else {
        _ipfsInitialized = false;
        DebugSerial.println("! WARN: IPFS requires WiFi connection. Disabled.");
    }
}

bool InterfaceManager::fetchIPFSContent(const char* ipfsHash, std::vector<uint8_t>& output) {
    output.clear();
    if (!_ipfsInitialized || WiFi.status() != WL_CONNECTED) {
        DebugSerial.println("! ERROR: IPFS not available (WiFi not connected)");
        return false;
    }
    
    if (!ipfsHash || strlen(ipfsHash) == 0 || strlen(ipfsHash) > 128) {
        DebugSerial.println("! ERROR: Invalid IPFS hash");
        return false;
    }

    // Validate IPFS hash: must be alphanumeric (CIDv0 base58 or CIDv1 base32)
    // Reject hashes containing path traversal, query strings, or other injection chars
    for (const char* p = ipfsHash; *p; ++p) {
        char c = *p;
        if (!((c >= 'a' && c <= 'z') || (c >= 'A' && c <= 'Z') || (c >= '0' && c <= '9'))) {
            DebugSerial.println("! ERROR: IPFS hash contains invalid characters");
            return false;
        }
    }
    
    // Build URL: gateway + hash
    String url = String(IPFS_GATEWAY_URL) + String(ipfsHash);
    
    DebugSerial.print("IF: Fetching IPFS content: ");
    DebugSerial.println(url);
    
    if (!_httpClient.begin(url)) {
        DebugSerial.println("! ERROR: Could not initialize IPFS HTTP request");
        return false;
    }
    _httpClient.setTimeout(IPFS_TIMEOUT_MS);
    
    int httpCode = _httpClient.GET();
    
    if (httpCode == HTTP_CODE_OK) {
        int contentLength = _httpClient.getSize();
        
        if (contentLength > 0 && contentLength <= IPFS_MAX_CONTENT_SIZE) {
            // Read content
            WiFiClient* stream = _httpClient.getStreamPtr();
            output.resize(contentLength);

            const size_t bytesRead = stream->readBytes(output.data(), static_cast<size_t>(contentLength));

            _httpClient.end();
            if (bytesRead != static_cast<size_t>(contentLength)) {
                output.clear();
                DebugSerial.println("! ERROR: Incomplete IPFS response body");
                return false;
            }
            recordInterfaceRx(InterfaceType::IPFS, bytesRead);
            DebugSerial.print("IF: IPFS content fetched: ");
            DebugSerial.print(bytesRead);
            DebugSerial.println(" bytes");
            return true;
        } else {
            DebugSerial.print("! ERROR: IPFS content too large: ");
            DebugSerial.println(contentLength);
            _httpClient.end();
            return false;
        }
    } else {
        DebugSerial.print("! ERROR: IPFS fetch failed, HTTP code: ");
        DebugSerial.println(httpCode);
        _httpClient.end();
        return false;
    }
}

